{
  "architectures": ["LlamaForCausalLMEagle3"],
  "model_type": "llama",
  "torch_dtype": "bfloat16",

  "hidden_size": 2880,
  "intermediate_size": 17280,
  "num_hidden_layers": 1,
  "num_attention_heads": 64,
  "num_key_value_heads": 8,
  "head_dim": 64,
  "hidden_act": "silu",
  "attention_bias": false,
  "attention_dropout": 0.0,
  "mlp_bias": false,
  "rms_norm_eps": 1e-05,
  "initializer_range": 0.02,
  "tie_word_embeddings": false,
  "pretraining_tp": 1,

  "vocab_size": 201088,
  "draft_vocab_size": null,
  "bos_token_id": null,
  "eos_token_id": null,

  "max_position_embeddings": 131072,
  "rope_theta": 500000.0,
  "rope_scaling": {
    "rope_type": "llama3",
    "factor": 8.0,
    "low_freq_factor": 1.0,
    "high_freq_factor": 4.0,
    "original_max_position_embeddings": 8192
  },

  "eagle_config": {
    "eagle_aux_hidden_state_layer_ids": [1, 17, 32],
    "use_aux_hidden_state": true,
    "use_input_layernorm_in_first_layer": true,
    "use_last_layernorm": true,
    "use_mtp_layernorm": false
  },

  "use_cache": true,
  "transformers_version": "4.55.2"
}
